import pandas as pd
import matplotlib.pyplot as plt

data = {
                'Имя': ['Alice','Bob', 'Charlie', 'David', 'Eve', 'Tom', 'Lina', 'Viki', 'Ron', 'Tim'],
                'Оценка по Математике': [5, 4, 3, 4, 4, 3, 5, 5, 3, 4],
                'Оценка по Русскому языку': [5, 4, 3, 5, 3, 5, 3, 5, 3, 2],
                'Оценка по Географии': [4, 2, 5, 4, 5, 3, 4, 5, 3, 4],
                'Оценка по Истроии': [4, 2, 5, 3, 5, 3, 5, 3, 3, 4],
                'Оценка по Физкультуре': [5, 5, 3, 4, 5, 3, 5, 5, 3, 4],
}

df = pd.DataFrame(data)
print(df.head())

print(f'Средняя оценка по Математике - {df['Оценка по Математике'].mean()}')
print(f'Средняя оценка по Русскому языку - {df['Оценка по Русскому языку'].mean()}')
print(f'Средняя оценка по Географии - {df['Оценка по Географии'].mean()}')
print(f'Средняя оценка по Истроии - {df['Оценка по Истроии'].mean()}')
print(f'Средняя оценка по Физкультуре - {df['Оценка по Физкультуре'].mean()}')

print(f'Медианная оценка по Математике - {df['Оценка по Математике'].median()}')
print(f'Медианная оценка по Русскому языку - {df['Оценка по Русскому языку'].median()}')
print(f'Медианная оценка по Географии - {df['Оценка по Географии'].median()}')
print(f'Медианная оценка по Истроии - {df['Оценка по Истроии'].median()}')
print(f'Медианная оценка по Физкультуре - {df['Оценка по Физкультуре'].median()}')

print(f'Стандартоне отклонение оценки по Математике - {df['Оценка по Математике'].std()}')
print(f'Стандартоне отклонение оценки по Русскому языку - {df['Оценка по Русскому языку'].std()}')
print(f'Стандартоне отклонение оценки по Географии - {df['Оценка по Географии'].std()}')
print(f'Стандартоне отклонение оценки по Истроии - {df['Оценка по Истроии'].std()}')
print(f'Стандартоне отклонение оценки по Физкультуре - {df['Оценка по Физкультуре'].std()}')

Q1 = df['Оценка по Математике'].quantile(0.25)
Q3 = df['Оценка по Математике'].quantile(0.75)
IQR = Q3 - Q1

downside = Q1 - 1.5 * IQR
upside = Q3 + 1.5 * IQR

df_new = df[(df['Оценка по Математике'] >= downside)&(df['Оценка по Математике'] <= upside)]
df_new.boxplot(column='Оценка по Математике')
plt.show()

